In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

from numpy.random import randn

In [2]:
ser = Series(randn(6),index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [3]:
ser

1  a    1.834921
   b   -0.362865
   c   -1.065066
2  a    0.296424
   b   -0.763651
   c    0.652122
dtype: float64

In [4]:
 ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [5]:
ser[1]

a    1.834921
b   -0.362865
c   -1.065066
dtype: float64

In [6]:
ser[1,'a']

1.834920852211395

In [7]:
ser[:,'a']

1    1.834921
2    0.296424
dtype: float64

In [8]:
dframe = ser.unstack()

In [9]:
dframe

          a         b         c
1  1.834921 -0.362865 -1.065066
2  0.296424 -0.763651  0.652122

In [10]:
dframe.unstack()

a  1    1.834921
   2    0.296424
b  1   -0.362865
   2   -0.763651
c  1   -1.065066
   2    0.652122
dtype: float64

In [11]:
dframe.T.unstack()

1  a    1.834921
   b   -0.362865
   c   -1.065066
2  a    0.296424
   b   -0.763651
   c    0.652122
dtype: float64

In [12]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),
                   index=[['a','a','b','b'],[1,2,1,2]],
                   columns=[['NYC','NYC','LA','SF'],['cold','cold','hot','hot']])

In [13]:
dframe2

     NYC       LA  SF
    cold cold hot hot
a 1    0    1   2   3
  2    4    5   6   7
b 1    8    9  10  11
  2   12   13  14  15

dframe2.index.names = ['INDEX1','INDEX2']

In [14]:
dframe2.index.names = ['INDEX1','INDEX2']

In [15]:
dframe2

               NYC       LA  SF
              cold cold hot hot
INDEX1 INDEX2
a      1         0    1   2   3
       2         4    5   6   7
b      1         8    9  10  11
       2        12   13  14  15

In [16]:
dframe2.columns.names = ['Cities','Temp']

In [17]:
dframe2

Cities         NYC       LA  SF
Temp          cold cold hot hot
INDEX1 INDEX2
a      1         0    1   2   3
       2         4    5   6   7
b      1         8    9  10  11
       2        12   13  14  15

In [18]:
dframe2.swaplevel('Cities','Temp',axis=1)

Temp          cold     hot
Cities         NYC NYC  LA  SF
INDEX1 INDEX2
a      1         0   1   2   3
       2         4   5   6   7
b      1         8   9  10  11
       2        12  13  14  15

In [19]:
dframe2.sum(level='Temp', axis=1)

Temp           cold  hot
INDEX1 INDEX2
a      1          1    5
       2          9   13
b      1         17   21
       2         25   29